package commands

const (
	General_Chat_ID       = "613857257460859029"
	Botchat_ID            = "617171312481140756"
	Pictures_Folder_Other = "other/"
	Bot_Greeting          = "Я ТУТ ГАЙЗ"
	Madina_Text           = `Мадина Мадина хинцам хьо зина,
	Сунам хьо гeнa яьлла чога хьо кур яьлла.
	Мадина Мадина ахьам со вина
	Кирар дог этина ахьам со талхина
	Гeнa яьлла кур яьлла хинцам хьо да тийна
	Сих елла xазa елла ахьам со виц вина
	Мадина Мадина дагна чов ахь йина
	Чога курал йина хинцам хьо датийна
	Мадина Мадина дагна чов ахь йина
	Хинцам хьо да тийна йокха курал йина
	Мамас хьо кач йина хаз йина лелин ю
	Папас хьо кур яькхна чог хьоме лелин ю
	Мадина Мадина суннам йори боьвзна
	Цара безам бела сунна хьо йицъелла
	Мадина Мадина суннам йори боьвзна
	Цара безам бела сунна хьо йицъелла
	Мадина Мадина царна со чог веза
	Айбина хьастина цара со цец векхна
	Мадина Мадина соьца хьа ца йина
	Сунам хьо ца еза ахьам со вина
	Мадина Мадина царна со чог веза
	Айбина хьастина цара со цец векхна
	Тешна бекх хьун ас бир бу хьо ас сайна йадор ю
	Соьца хьо ехар ю асам хьо хьийзор ю
	Мадина Мадина аьхь доцу баран ду хьун каринаг
	Асам сайн хьо йогур ю хьун тэ зуд ас йалор ю
	Мадина Мадина ахьам со вина
	хьай дог сун схьа дела ахьам со галл ваьхкха
	Мадина Мадина ахьам со вина
	хьай дог сун схьа дела ахьам со галл ваьхкха`

	Delete_Usage    = "Я не знаю хотел ты удалить сообщения или нет, но если хотел, нужно написать сколько. Например 'Удали 5'"
	Delete_Success  = "Мусор вынесен!"
	Delete_FuckYou  = "Мусор уже вынесли, пиздуй давай"
	Delete_Failed   = "Не получилось удалить( Может, там сообщения старше двух недель, такие дискорд удалять не даёт"
	Something_Broke = "ойой чета паламалась( Напиши Ендерлолу он там посмотрит че поломалось"
	Server_Invite   = "https://discord.gg/UvEZHak"
)

// IDs
const (
	Enderlord_ID      = "329339194029899776"
	Giogis_ID         = "333343403163123712"
	Mozart_ID         = "395293715742064641"
	AYS_ID            = "328835966783717386"
	Makich_ID         = "395319132863856650"
	Mk7k_ID           = "310408199658405901"
	Vnatureloh_ID     = "431920924946858004"
	David_ID          = "413729427227410442"
	Zeeklik_ID        = "378566714310262785" //or xawawin ya xz
	Squirtana_ID      = "516013742560116741"
	Neaus_ID          = "359012016876421131"
	Ruslan_ID         = "388390646945284097"
	Jude_ID           = "333341352404320267" //normal ruslan
	Ducks_Fuhrer_ID   = "395304841812901888"
	Japi_ID           = "403451995601764352"
	Seagull_ID        = "395256828075704322"
	Tanya_ID          = "554784820924907570"
	KateMoss_ID       = "434375071591563264"
	Soldat_ID         = "911692496227139675"
	Ya_ti_chmo_ID     = "796899505181032509"
	Mudak_i_gandon_ID = "395544758832988160"
	TriGunD_ID        = "313007272127102986"
)

// Names corresponding to IDs
var Discord_names = map[string]string{

	Giogis_ID:         "Олег",
	Mozart_ID:         "Даня",
	KateMoss_ID:       "Никита",
	Soldat_ID:         "Никита",
	Ya_ti_chmo_ID:     "Никита",
	Mudak_i_gandon_ID: "Никита",
	TriGunD_ID:        "Никита",
	AYS_ID:            "Айс",
	Makich_ID:         "Вова",
	Mk7k_ID:           "Михей",
	Vnatureloh_ID:     "Сандро",
	David_ID:          "Давид",
	Zeeklik_ID:        "Эрик",
	Squirtana_ID:      "Дима",
	Neaus_ID:          "Карпов",
	Ducks_Fuhrer_ID:   "Вадим",
	Ruslan_ID:         "Руслан",
	Japi_ID:           "Агапи",
	Seagull_ID:        "Сигал",
	Tanya_ID:          "Таня",
	// Giogis_ID:            "Олег",
}
