package commands

const (
	General_Chat_ID       = "613857257460859029"
	Botchat_ID            = "617171312481140756"
	Pictures_Folder_Other = "other/"
	Madina_Text           = `Мадина Мадина хинцам хьо зина,
	Сунам хьо гeнa яьлла чога хьо кур яьлла.
	Мадина Мадина ахьам со вина
	Кирар дог этина ахьам со талхина
	Гeнa яьлла кур яьлла хинцам хьо да тийна
	Сих елла xазa елла ахьам со виц вина
	Мадина Мадина дагна чов ахь йина
	Чога курал йина хинцам хьо датийна
	Мадина Мадина дагна чов ахь йина
	Хинцам хьо да тийна йокха курал йина
	Мамас хьо кач йина хаз йина лелин ю
	Папас хьо кур яькхна чог хьоме лелин ю
	Мадина Мадина суннам йори боьвзна
	Цара безам бела сунна хьо йицъелла
	Мадина Мадина суннам йори боьвзна
	Цара безам бела сунна хьо йицъелла
	Мадина Мадина царна со чог веза
	Айбина хьастина цара со цец векхна
	Мадина Мадина соьца хьа ца йина
	Сунам хьо ца еза ахьам со вина
	Мадина Мадина царна со чог веза
	Айбина хьастина цара со цец векхна
	Тешна бекх хьун ас бир бу хьо ас сайна йадор ю
	Соьца хьо ехар ю асам хьо хьийзор ю
	Мадина Мадина аьхь доцу баран ду хьун каринаг
	Асам сайн хьо йогур ю хьун тэ зуд ас йалор ю
	Мадина Мадина ахьам со вина
	хьай дог сун схьа дела ахьам со галл ваьхкха
	Мадина Мадина ахьам со вина
	хьай дог сун схьа дела ахьам со галл ваьхкха`
	Minesweeper = `||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:one:||||:boom:||||:one:||
	||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:two:||||:three:||||:three:||
	||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:one:||||:one:||||:two:||||:boom:||||:boom:||
	||:stop_button:||||:stop_button:||||:stop_button:||||:stop_button:||||:one:||||:boom:||||:two:||||:two:||||:two:||
	||:one:||||:one:||||:one:||||:stop_button:||||:one:||||:one:||||:one:||||:stop_button:||||:stop_button:||
	||:one:||||:boom:||||:two:||||:one:||||:one:||||:stop_button:||||:stop_button:||||:one:||||:one:||
	||:one:||||:one:||||:two:||||:boom:||||:one:||||:stop_button:||||:one:||||:two:||||:boom:||
	||:stop_button:||||:stop_button:||||:one:||||:two:||||:two:||||:one:||||:two:||||:boom:||||:three:||
	||:stop_button:||||:stop_button:||||:stop_button:||||:one:||||:boom:||||:one:||||:two:||||:boom:||||:two:||`

	Delete_Usage   = "Я не знаю хотел ты удалить сообщения или нет, но если хотел, нужно написать сколько. Например 'Удали 5'"
	Delete_Success = "Мусор вынесен!"
	Delete_FuckYou = "Мусор уже вынесли, пиздуй давай"
)

//IDs
const (
	Enderlord_ID	= "329339194029899776"
	Giogis_ID 		= "333343403163123712"
	Mozart_ID 		= "395293715742064641"
	AYS_ID	 		= "328835966783717386"
	Makich_ID 		= "395319132863856650"
	Mk7k_ID 		= "310408199658405901"
	Vnatureloh_ID 	= "431920924946858004"
	David_ID 		= "413729427227410442"
	Zeeklik_ID 		= "378566714310262785" //or xawawin ya xz
	Squirtana_ID 	= "516013742560116741"
	Neaus_ID 		= "359012016876421131"
	Ruslan_ID 		= "333341352404320267"
	//need to get women IDs, and Kozlov/Ruslan
	// Zeeklik_ID 		= "378566714310262785"
	// Zeeklik_ID 		= "378566714310262785"
	// Zeeklik_ID 		= "378566714310262785"
	// Zeeklik_ID 		= "378566714310262785"
)
